<script type="ts">
  import { storage } from '@/data/storage'

  import AlignCenter from '@/ui/AlignCenter.svelte'
  import Button from '@/ui/Button.svelte'

  export let onContinue: () => void

  const variant = storage.variant
</script>

<h1>Инструкция</h1>

{#if variant===1}
  <p>Вам предстоит 50 раз перевернуть карты из бесконечной последовательности. Обратная сторона карт либо синяя, либо красная. В двух из трёх случаев (то есть, с вероятностью около 66,6%) карта синяя, в остальных случаях — красная.</p>
  <p>Ваша задача — угадать цвет каждой карты. Нажмите на кнопку, соответствующую предполагаемому цвету карты. Вы увидите, угадали или нет.</p>
{/if}

{#if variant===2}
  <p>Вам предстоит 50 раз перевернуть синие и красные карты из бесконечной последовательности. В двух из трёх случаев (то есть, с вероятностью около 66,6%) с обратной стороны карта того же цвета, что и с передней, в остальных случаях — другого.</p>
  <p>Ваша задача — угадать цвет обратной стороны каждой карты. Выберите вариант, соответствующий предполагаемому цвету карты. Вы увидите, угадали или нет.</p>
{/if}

{#if variant===3}
  <p>Перед вами бесконечная последовательность людей либо в синем, либо в красном ведре. Оно скрывает волосы либо синего, либо красного цвета. В двух из трёх случаев (то есть, с вероятностью около 66,6%) волосы того же цвета, что и ведро.</p>
  <p>Ваша задача — угадать цвет волос в 50 раундах. Выберите вариант, соответствующий предполагаемому цвету волос. Вы увидите, угадали или нет.</p>
{/if}

<p>За каждое верное угадывание вам начисляются 10 баллов — их количество всегда можно посмотреть в правом верхнем углу экрана. Постарайтесь набрать как можно больше баллов.</p>

<AlignCenter>
  <Button text="продолжить" color="success" onClick={onContinue} />
</AlignCenter>
