<script type="ts">
  import { storage } from '@/data/storage'

  import AlignCenter from '@/ui/AlignCenter.svelte'
  import Button from '@/ui/Button.svelte'

  export let onContinue: () => void

  const variant = storage.variant
</script>

<h1>Инструкция</h1>

{#if variant===1}
  <p>Перед вами лежит колода из 50 карт. Обратная сторона карты либо синяя, либо красная. В двух из трёх случаев (то есть, с вероятностью около 66,6%) карта синяя, в остальных случаях — красная.</p>
  <p>Ваша задача — угадать цвет каждой карты. Нажмите на кнопку, соответствующую предполагаемому цвету карты. Вы увидите, угадали или нет. В ходе игры вероятности не меняются.</p>
{/if}

{#if variant===2}
  <p>Перед вами лежит колода из 50 синих и красных карт. С обратной стороны карты тоже могут быть либо синими, либо красными. В двух из трёх случаев (то есть, с вероятностью около 66,6%) с обратной стороны карта того же цвета, что и с передней, в остальных случаях — другого.</p>
  <p>Ваша задача — угадать цвет обратной стороны каждой карты. Выберите вариант, соответствующий предполагаемому цвету карты. Вы увидите, угадали или нет. В ходе игры вероятности не меняются.</p>
{/if}

{#if variant===3}
  <p>ПВам по очереди будут предъявлены 50 человек либо в синем, либо в красном головном уборе. Он скрывает волосы либо синего, либо красного цвета. В двух из трёх случаев (то есть, с вероятностью около 66,6%) волосы того же цвета, что и шапка.</p>
  <p>Ваша задача — угадать цвет волос 50 человек. Выберите вариант, соответствующий предполагаемому цвету волос. Вы увидите, угадали или нет. В ходе игры вероятности не меняются.</p>
{/if}

<p>За каждое верное угадывание вам начисляются 10 баллов — их количество всегда будет видно вверху экрана. Постарайтесь набрать как можно больше баллов.</p>

<AlignCenter>
  <Button text="продолжить" color="success" onClick={onContinue} />
</AlignCenter>
